espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_I2S0_INTR_MAP_REG register
 *  I2S0_INTR mapping register
 */
#define INTERRUPT_CORE1_I2S0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x18)
/** INTERRUPT_CORE1_I2S0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_I2S0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_I2S0_INTR_MAP_M  (INTERRUPT_CORE1_I2S0_INTR_MAP_V << INTERRUPT_CORE1_I2S0_INTR_MAP_S)
#define INTERRUPT_CORE1_I2S0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_I2S0_INTR_MAP_S  0
/** INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_I2S0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_I2S1_INTR_MAP_REG register
 *  I2S1_INTR mapping register
 */
#define INTERRUPT_CORE1_I2S1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1c)
/** INTERRUPT_CORE1_I2S1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_I2S1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_I2S1_INTR_MAP_M  (INTERRUPT_CORE1_I2S1_INTR_MAP_V << INTERRUPT_CORE1_I2S1_INTR_MAP_S)
#define INTERRUPT_CORE1_I2S1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_I2S1_INTR_MAP_S  0
/** INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_I2S1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_UHCI0_INTR_MAP_REG register
 *  UHCI0_INTR mapping register
 */
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x20)
/** INTERRUPT_CORE1_UHCI0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_UHCI0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_M  (INTERRUPT_CORE1_UHCI0_INTR_MAP_V << INTERRUPT_CORE1_UHCI0_INTR_MAP_S)
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_S  0
/** INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_UHCI0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_UART0_INTR_MAP_REG register
 *  UART0_INTR mapping register
 */
#define INTERRUPT_CORE1_UART0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x24)
/** INTERRUPT_CORE1_UART0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_UART0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_UART0_INTR_MAP_M  (INTERRUPT_CORE1_UART0_INTR_MAP_V << INTERRUPT_CORE1_UART0_INTR_MAP_S)
#define INTERRUPT_CORE1_UART0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_UART0_INTR_MAP_S  0
/** INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_UART0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_UART1_INTR_MAP_REG register
 *  UART1_INTR mapping register
 */
#define INTERRUPT_CORE1_UART1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x28)
/** INTERRUPT_CORE1_UART1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_UART1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_UART1_INTR_MAP_M  (INTERRUPT_CORE1_UART1_INTR_MAP_V << INTERRUPT_CORE1_UART1_INTR_MAP_S)
#define INTERRUPT_CORE1_UART1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_UART1_INTR_MAP_S  0
/** INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_UART1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_UART2_INTR_MAP_REG register
 *  UART2_INTR mapping register
 */
#define INTERRUPT_CORE1_UART2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2c)
/** INTERRUPT_CORE1_UART2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_UART2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_UART2_INTR_MAP_M  (INTERRUPT_CORE1_UART2_INTR_MAP_V << INTERRUPT_CORE1_UART2_INTR_MAP_S)
#define INTERRUPT_CORE1_UART2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_UART2_INTR_MAP_S  0
/** INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_UART2_INTR_PASS_LEVEL_S  8

