espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_UART3_INTR_MAP_REG register
 *  UART3_INTR mapping register
 */
#define INTERRUPT_CORE1_UART3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x30)
/** INTERRUPT_CORE1_UART3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_UART3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_UART3_INTR_MAP_M  (INTERRUPT_CORE1_UART3_INTR_MAP_V << INTERRUPT_CORE1_UART3_INTR_MAP_S)
#define INTERRUPT_CORE1_UART3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_UART3_INTR_MAP_S  0
/** INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_UART3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LCD_CAM_INTR_MAP_REG register
 *  LCD_CAM_INTR mapping register
 */
#define INTERRUPT_CORE1_LCD_CAM_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x34)
/** INTERRUPT_CORE1_LCD_CAM_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LCD_CAM_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LCD_CAM_INTR_MAP_M  (INTERRUPT_CORE1_LCD_CAM_INTR_MAP_V << INTERRUPT_CORE1_LCD_CAM_INTR_MAP_S)
#define INTERRUPT_CORE1_LCD_CAM_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LCD_CAM_INTR_MAP_S  0
/** INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LCD_CAM_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_PWM0_INTR_MAP_REG register
 *  PWM0_INTR mapping register
 */
#define INTERRUPT_CORE1_PWM0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x38)
/** INTERRUPT_CORE1_PWM0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_PWM0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_PWM0_INTR_MAP_M  (INTERRUPT_CORE1_PWM0_INTR_MAP_V << INTERRUPT_CORE1_PWM0_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_PWM0_INTR_MAP_S  0
/** INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_PWM0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_PWM1_INTR_MAP_REG register
 *  PWM1_INTR mapping register
 */
#define INTERRUPT_CORE1_PWM1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x3c)
/** INTERRUPT_CORE1_PWM1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_PWM1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_PWM1_INTR_MAP_M  (INTERRUPT_CORE1_PWM1_INTR_MAP_V << INTERRUPT_CORE1_PWM1_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_PWM1_INTR_MAP_S  0
/** INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_PWM1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_PWM2_INTR_MAP_REG register
 *  PWM2_INTR mapping register
 */
#define INTERRUPT_CORE1_PWM2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x40)
/** INTERRUPT_CORE1_PWM2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_PWM2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_PWM2_INTR_MAP_M  (INTERRUPT_CORE1_PWM2_INTR_MAP_V << INTERRUPT_CORE1_PWM2_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_PWM2_INTR_MAP_S  0
/** INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_PWM2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_PWM3_INTR_MAP_REG register
 *  PWM3_INTR mapping register
 */
#define INTERRUPT_CORE1_PWM3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x44)
/** INTERRUPT_CORE1_PWM3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_PWM3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_PWM3_INTR_MAP_M  (INTERRUPT_CORE1_PWM3_INTR_MAP_V << INTERRUPT_CORE1_PWM3_INTR_MAP_S)
#define INTERRUPT_CORE1_PWM3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_PWM3_INTR_MAP_S  0
/** INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_PWM3_INTR_PASS_LEVEL_S  8

