espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_CAN0_INTR_MAP_REG register
 *  CAN0_INTR mapping register
 */
#define INTERRUPT_CORE1_CAN0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x48)
/** INTERRUPT_CORE1_CAN0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CAN0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CAN0_INTR_MAP_M  (INTERRUPT_CORE1_CAN0_INTR_MAP_V << INTERRUPT_CORE1_CAN0_INTR_MAP_S)
#define INTERRUPT_CORE1_CAN0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CAN0_INTR_MAP_S  0
/** INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CAN0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_REG register
 *  CAN0_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x4c)
/** INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_M  (INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_V << INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CAN0_TIMER_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CAN1_INTR_MAP_REG register
 *  CAN1_INTR mapping register
 */
#define INTERRUPT_CORE1_CAN1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x50)
/** INTERRUPT_CORE1_CAN1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CAN1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CAN1_INTR_MAP_M  (INTERRUPT_CORE1_CAN1_INTR_MAP_V << INTERRUPT_CORE1_CAN1_INTR_MAP_S)
#define INTERRUPT_CORE1_CAN1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CAN1_INTR_MAP_S  0
/** INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CAN1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_REG register
 *  CAN1_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x54)
/** INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_M  (INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_V << INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CAN1_TIMER_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_RMT_INTR_MAP_REG register
 *  RMT_INTR mapping register
 */
#define INTERRUPT_CORE1_RMT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x58)
/** INTERRUPT_CORE1_RMT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_RMT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_RMT_INTR_MAP_M  (INTERRUPT_CORE1_RMT_INTR_MAP_V << INTERRUPT_CORE1_RMT_INTR_MAP_S)
#define INTERRUPT_CORE1_RMT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_RMT_INTR_MAP_S  0
/** INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_RMT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_I2C0_INTR_MAP_REG register
 *  I2C0_INTR mapping register
 */
#define INTERRUPT_CORE1_I2C0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x5c)
/** INTERRUPT_CORE1_I2C0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_I2C0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_I2C0_INTR_MAP_M  (INTERRUPT_CORE1_I2C0_INTR_MAP_V << INTERRUPT_CORE1_I2C0_INTR_MAP_S)
#define INTERRUPT_CORE1_I2C0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_I2C0_INTR_MAP_S  0
/** INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_I2C0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_I2C1_INTR_MAP_REG register
 *  I2C1_INTR mapping register
 */
#define INTERRUPT_CORE1_I2C1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x60)
/** INTERRUPT_CORE1_I2C1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_I2C1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_I2C1_INTR_MAP_M  (INTERRUPT_CORE1_I2C1_INTR_MAP_V << INTERRUPT_CORE1_I2C1_INTR_MAP_S)
#define INTERRUPT_CORE1_I2C1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_I2C1_INTR_MAP_S  0
/** INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_I2C1_INTR_PASS_LEVEL_S  8

