espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_REG register
 *  TIMERGRP0_T0_INTR mapping register
 */
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x64)
/** INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_M  (INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_V << INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_S)
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_MAP_S  0
/** INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_TIMERGRP0_T0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_REG register
 *  TIMERGRP0_T1_INTR mapping register
 */
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x68)
/** INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_M  (INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_V << INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_S)
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_MAP_S  0
/** INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_TIMERGRP0_T1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_REG register
 *  TIMERGRP0_WDT_INTR mapping register
 */
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x6c)
/** INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_M  (INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_V << INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_S)
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_TIMERGRP0_WDT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_REG register
 *  TIMERGRP1_T0_INTR mapping register
 */
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x70)
/** INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_M  (INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_V << INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_S)
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_MAP_S  0
/** INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_TIMERGRP1_T0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_REG register
 *  TIMERGRP1_T1_INTR mapping register
 */
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x74)
/** INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_M  (INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_V << INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_S)
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_MAP_S  0
/** INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_TIMERGRP1_T1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_REG register
 *  TIMERGRP1_WDT_INTR mapping register
 */
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x78)
/** INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_M  (INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_V << INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_S)
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_TIMERGRP1_WDT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LEDC0_INTR_MAP_REG register
 *  LEDC0_INTR mapping register
 */
#define INTERRUPT_CORE1_LEDC0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x7c)
/** INTERRUPT_CORE1_LEDC0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LEDC0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LEDC0_INTR_MAP_M  (INTERRUPT_CORE1_LEDC0_INTR_MAP_V << INTERRUPT_CORE1_LEDC0_INTR_MAP_S)
#define INTERRUPT_CORE1_LEDC0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LEDC0_INTR_MAP_S  0
/** INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LEDC0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LEDC1_INTR_MAP_REG register
 *  LEDC1_INTR mapping register
 */
#define INTERRUPT_CORE1_LEDC1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x80)
/** INTERRUPT_CORE1_LEDC1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LEDC1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LEDC1_INTR_MAP_M  (INTERRUPT_CORE1_LEDC1_INTR_MAP_V << INTERRUPT_CORE1_LEDC1_INTR_MAP_S)
#define INTERRUPT_CORE1_LEDC1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LEDC1_INTR_MAP_S  0
/** INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LEDC1_INTR_PASS_LEVEL_S  8

