espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_REG register
 *  AHB_PDMA_IN_CH4_INTR mapping register
 */
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xa0)
/** INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_M  (INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_V << INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_S)
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_MAP_S  0
/** INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_REG register
 *  AHB_PDMA_OUT_CH0_INTR mapping register
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xa4)
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_REG register
 *  AHB_PDMA_OUT_CH1_INTR mapping register
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xa8)
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_REG register
 *  AHB_PDMA_OUT_CH2_INTR mapping register
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xac)
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_MAP_S  0
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_REG register
 *  AHB_PDMA_OUT_CH3_INTR mapping register
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xb0)
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_MAP_S  0
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_REG register
 *  AHB_PDMA_OUT_CH4_INTR mapping register
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xb4)
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_MAP_S  0
/** INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AHB_PDMA_OUT_CH4_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_REG register
 *  ASRC_CHNL0_INTR mapping register
 */
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xb8)
/** INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_M  (INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_V << INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_S)
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_MAP_S  0
/** INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_ASRC_CHNL0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_REG register
 *  ASRC_CHNL1_INTR mapping register
 */
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xbc)
/** INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_M  (INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_V << INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_S)
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_MAP_S  0
/** INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_ASRC_CHNL1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_REG register
 *  AXI_PDMA_IN_CH0_INTR mapping register
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc0)
/** INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_M  (INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_V << INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_S)
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_REG register
 *  AXI_PDMA_IN_CH1_INTR mapping register
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc4)
/** INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_M  (INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_V << INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_S)
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_REG register
 *  AXI_PDMA_IN_CH2_INTR mapping register
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xc8)
/** INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_M  (INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_V << INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_S)
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_MAP_S  0
/** INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_IN_CH2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_REG register
 *  AXI_PDMA_OUT_CH0_INTR mapping register
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xcc)
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_M  (INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_V << INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_S)
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_REG register
 *  AXI_PDMA_OUT_CH1_INTR mapping register
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd0)
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_M  (INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_V << INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_S)
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH1_INTR_PASS_LEVEL_S  8

