espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_REG register
 *  AXI_PDMA_OUT_CH2_INTR mapping register
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd4)
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_M  (INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_V << INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_S)
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_MAP_S  0
/** INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AXI_PDMA_OUT_CH2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_RSA_INTR_MAP_REG register
 *  RSA_INTR mapping register
 */
#define INTERRUPT_CORE1_RSA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xd8)
/** INTERRUPT_CORE1_RSA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_RSA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_RSA_INTR_MAP_M  (INTERRUPT_CORE1_RSA_INTR_MAP_V << INTERRUPT_CORE1_RSA_INTR_MAP_S)
#define INTERRUPT_CORE1_RSA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_RSA_INTR_MAP_S  0
/** INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_RSA_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_AES_INTR_MAP_REG register
 *  AES_INTR mapping register
 */
#define INTERRUPT_CORE1_AES_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xdc)
/** INTERRUPT_CORE1_AES_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_AES_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_AES_INTR_MAP_M  (INTERRUPT_CORE1_AES_INTR_MAP_V << INTERRUPT_CORE1_AES_INTR_MAP_S)
#define INTERRUPT_CORE1_AES_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_AES_INTR_MAP_S  0
/** INTERRUPT_CORE1_AES_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_AES_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_AES_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_AES_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_AES_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_AES_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_AES_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_SHA_INTR_MAP_REG register
 *  SHA_INTR mapping register
 */
#define INTERRUPT_CORE1_SHA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe0)
/** INTERRUPT_CORE1_SHA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_SHA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_SHA_INTR_MAP_M  (INTERRUPT_CORE1_SHA_INTR_MAP_V << INTERRUPT_CORE1_SHA_INTR_MAP_S)
#define INTERRUPT_CORE1_SHA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_SHA_INTR_MAP_S  0
/** INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_SHA_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_ECC_INTR_MAP_REG register
 *  ECC_INTR mapping register
 */
#define INTERRUPT_CORE1_ECC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe4)
/** INTERRUPT_CORE1_ECC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_ECC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_ECC_INTR_MAP_M  (INTERRUPT_CORE1_ECC_INTR_MAP_V << INTERRUPT_CORE1_ECC_INTR_MAP_S)
#define INTERRUPT_CORE1_ECC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_ECC_INTR_MAP_S  0
/** INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_ECC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_ECDSA_INTR_MAP_REG register
 *  ECDSA_INTR mapping register
 */
#define INTERRUPT_CORE1_ECDSA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0xe8)
/** INTERRUPT_CORE1_ECDSA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_ECDSA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_ECDSA_INTR_MAP_M  (INTERRUPT_CORE1_ECDSA_INTR_MAP_V << INTERRUPT_CORE1_ECDSA_INTR_MAP_S)
#define INTERRUPT_CORE1_ECDSA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_ECDSA_INTR_MAP_S  0
/** INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_ECDSA_INTR_PASS_LEVEL_S  8

