espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_REG register
 *  CPU_INTR_FROM_CPU_3 mapping register
 */
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x110)
/** INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_M  (INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_V << INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_S)
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_MAP_S  0
/** INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_INTR_FROM_CPU_3_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CACHE_INTR_MAP_REG register
 *  CACHE_INTR mapping register
 */
#define INTERRUPT_CORE1_CACHE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x114)
/** INTERRUPT_CORE1_CACHE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CACHE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CACHE_INTR_MAP_M  (INTERRUPT_CORE1_CACHE_INTR_MAP_V << INTERRUPT_CORE1_CACHE_INTR_MAP_S)
#define INTERRUPT_CORE1_CACHE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CACHE_INTR_MAP_S  0
/** INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CACHE_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_REG register
 *  CPU_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x118)
/** INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_M  (INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_V << INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_MAP_S  0
/** INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_REG register
 *  CPU_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x11c)
/** INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_M  (INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_V << INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_MAP_S  0
/** INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_REG register
 *  CPU_APM_M2_INTR mapping register
 */
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x120)
/** INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_M  (INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_V << INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_S)
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_MAP_S  0
/** INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_REG register
 *  CPU_APM_M3_INTR mapping register
 */
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x124)
/** INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_M  (INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_V << INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_S)
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_MAP_S  0
/** INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_APM_M3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_REG register
 *  HP_MEM_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x128)
/** INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_M  (INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_V << INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_REG register
 *  HP_MEM_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x12c)
/** INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_M  (INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_V << INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_REG register
 *  HP_MEM_APM_M2_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x130)
/** INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_M  (INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_V << INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_REG register
 *  HP_MEM_APM_M3_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x134)
/** INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_M  (INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_V << INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_REG register
 *  HP_MEM_APM_M4_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x138)
/** INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_M  (INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_V << INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M4_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_REG register
 *  HP_MEM_APM_M5_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x13c)
/** INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_M  (INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_V << INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_MEM_APM_M5_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_REG register
 *  CPU_PERI0_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x140)
/** INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_PERI0_TIMEOUT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_REG register
 *  CPU_PERI1_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x144)
/** INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CPU_PERI1_TIMEOUT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_REG register
 *  HP_PERI0_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x148)
/** INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_PERI0_TIMEOUT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_REG register
 *  HP_PERI1_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x14c)
/** INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_PERI1_TIMEOUT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_REG register
 *  HP_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x150)
/** INTERRUPT_CORE1_HP_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_M  (INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_V << INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_APM_M0_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_APM_M0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_REG register
 *  HP_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x154)
/** INTERRUPT_CORE1_HP_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_M  (INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_V << INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_APM_M1_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_APM_M1_INTR_PASS_LEVEL_S  8

