espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_PCNT0_INTR_MAP_REG register
 *  PCNT0_INTR mapping register
 */
#define INTERRUPT_CORE1_PCNT0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1c8)
/** INTERRUPT_CORE1_PCNT0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_PCNT0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_PCNT0_INTR_MAP_M  (INTERRUPT_CORE1_PCNT0_INTR_MAP_V << INTERRUPT_CORE1_PCNT0_INTR_MAP_S)
#define INTERRUPT_CORE1_PCNT0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_PCNT0_INTR_MAP_S  0
/** INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_PCNT0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_PCNT1_INTR_MAP_REG register
 *  PCNT1_INTR mapping register
 */
#define INTERRUPT_CORE1_PCNT1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1cc)
/** INTERRUPT_CORE1_PCNT1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_PCNT1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_PCNT1_INTR_MAP_M  (INTERRUPT_CORE1_PCNT1_INTR_MAP_V << INTERRUPT_CORE1_PCNT1_INTR_MAP_S)
#define INTERRUPT_CORE1_PCNT1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_PCNT1_INTR_MAP_S  0
/** INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_PCNT1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_PAU_INTR_MAP_REG register
 *  HP_PAU_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_PAU_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1d0)
/** INTERRUPT_CORE1_HP_PAU_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_PAU_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_PAU_INTR_MAP_M  (INTERRUPT_CORE1_HP_PAU_INTR_MAP_V << INTERRUPT_CORE1_HP_PAU_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_PAU_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_PAU_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_PAU_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_REG register
 *  HP_PARLIO_RX_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1d4)
/** INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_M  (INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_V << INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_PARLIO_RX_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_REG register
 *  HP_PARLIO_TX_INTR mapping register
 */
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1d8)
/** INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_M  (INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_V << INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_S)
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_MAP_S  0
/** INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_HP_PARLIO_TX_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_REG register
 *  BUS_MONITOR_INTR mapping register
 */
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1dc)
/** INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_M  (INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_V << INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_S)
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_MAP_S  0
/** INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_BUS_MONITOR_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_REG register
 *  MODEM_WIFI_MAC_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1e0)
/** INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_V << INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_REG register
 *  MODEM_WIFI_MAC_NMI_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1e4)
/** INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_V << INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_REG register
 *  MODEM_WIFI_PWR_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1e8)
/** INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_V << INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_PWR_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_REG register
 *  MODEM_WIFI_BB_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1ec)
/** INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_V << INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_WIFI_BB_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_REG register
 *  MODEM_BT_MAC_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1f0)
/** INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_V << INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_MAC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_REG register
 *  MODEM_BT_BB_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1f4)
/** INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_V << INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_BB_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_REG register
 *  MODEM_BT_BB_NMI_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1f8)
/** INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_V << INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_REG register
 *  MODEM_LP_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x1fc)
/** INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_V << INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_LP_TIMER_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_REG register
 *  MODEM_COEX_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x200)
/** INTERRUPT_CORE1_MODEM_COEX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_COEX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_V << INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_COEX_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_COEX_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_REG register
 *  MODEM_BLE_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x204)
/** INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_V << INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_BLE_TIMER_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_REG register
 *  MODEM_BLE_SEC_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x208)
/** INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_V << INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_BLE_SEC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_REG register
 *  MODEM_I2C_MST_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x20c)
/** INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_V << INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_I2C_MST_INTR_PASS_LEVEL_S  8

