espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_REG register
 *  MODEM_ZB_MAC_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x210)
/** INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_V << INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_ZB_MAC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_REG register
 *  MODEM_BT_MAC_INT1_INTR mapping register
 */
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x214)
/** INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_M  (INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_V << INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_S)
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_MAP_S  0
/** INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_CORDIC_INTR_MAP_REG register
 *  CORDIC_INTR mapping register
 */
#define INTERRUPT_CORE1_CORDIC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x218)
/** INTERRUPT_CORE1_CORDIC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_CORDIC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_CORDIC_INTR_MAP_M  (INTERRUPT_CORE1_CORDIC_INTR_MAP_V << INTERRUPT_CORE1_CORDIC_INTR_MAP_S)
#define INTERRUPT_CORE1_CORDIC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_CORDIC_INTR_MAP_S  0
/** INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_CORDIC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_ZERO_DET_INTR_MAP_REG register
 *  ZERO_DET_INTR mapping register
 */
#define INTERRUPT_CORE1_ZERO_DET_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x21c)
/** INTERRUPT_CORE1_ZERO_DET_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_ZERO_DET_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_ZERO_DET_INTR_MAP_M  (INTERRUPT_CORE1_ZERO_DET_INTR_MAP_V << INTERRUPT_CORE1_ZERO_DET_INTR_MAP_S)
#define INTERRUPT_CORE1_ZERO_DET_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_ZERO_DET_INTR_MAP_S  0
/** INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_ZERO_DET_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_WDT_INTR_MAP_REG register
 *  LP_WDT_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_WDT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x220)
/** INTERRUPT_CORE1_LP_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_WDT_INTR_MAP_M  (INTERRUPT_CORE1_LP_WDT_INTR_MAP_V << INTERRUPT_CORE1_LP_WDT_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_WDT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_REG register
 *  LP_TIMER_REG_0_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x224)
/** INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_M  (INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_V << INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_TIMER_REG_0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_REG register
 *  LP_TIMER_REG_1_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x228)
/** INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_M  (INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_V << INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_TIMER_REG_1_INTR_PASS_LEVEL_S  8

