espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_LP_DAC_INTR_MAP_REG register
 *  LP_DAC_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_DAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x244)
/** INTERRUPT_CORE1_LP_DAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_DAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_DAC_INTR_MAP_M  (INTERRUPT_CORE1_LP_DAC_INTR_MAP_V << INTERRUPT_CORE1_LP_DAC_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_DAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_DAC_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_DAC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_GPIO_INTR_MAP_REG register
 *  LP_GPIO_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_GPIO_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x248)
/** INTERRUPT_CORE1_LP_GPIO_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_GPIO_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_GPIO_INTR_MAP_M  (INTERRUPT_CORE1_LP_GPIO_INTR_MAP_V << INTERRUPT_CORE1_LP_GPIO_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_GPIO_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_GPIO_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_GPIO_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_I2C_INTR_MAP_REG register
 *  LP_I2C_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_I2C_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x24c)
/** INTERRUPT_CORE1_LP_I2C_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_I2C_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_I2C_INTR_MAP_M  (INTERRUPT_CORE1_LP_I2C_INTR_MAP_V << INTERRUPT_CORE1_LP_I2C_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_I2C_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_I2C_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_I2C_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_SPI_INTR_MAP_REG register
 *  LP_SPI_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_SPI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x250)
/** INTERRUPT_CORE1_LP_SPI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_SPI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_SPI_INTR_MAP_M  (INTERRUPT_CORE1_LP_SPI_INTR_MAP_V << INTERRUPT_CORE1_LP_SPI_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_SPI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_SPI_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_SPI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_REG register
 *  LP_TOUCH_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x254)
/** INTERRUPT_CORE1_LP_TOUCH_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_TOUCH_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_M  (INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_V << INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_TOUCH_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_TOUCH_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_TSENS_INTR_MAP_REG register
 *  LP_TSENS_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_TSENS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x258)
/** INTERRUPT_CORE1_LP_TSENS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_TSENS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_TSENS_INTR_MAP_M  (INTERRUPT_CORE1_LP_TSENS_INTR_MAP_V << INTERRUPT_CORE1_LP_TSENS_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_TSENS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_TSENS_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_TSENS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_UART_INTR_MAP_REG register
 *  LP_UART_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_UART_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x25c)
/** INTERRUPT_CORE1_LP_UART_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_UART_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_UART_INTR_MAP_M  (INTERRUPT_CORE1_LP_UART_INTR_MAP_V << INTERRUPT_CORE1_LP_UART_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_UART_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_UART_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_UART_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_REG register
 *  LP_EFUSE_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x260)
/** INTERRUPT_CORE1_LP_EFUSE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_EFUSE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_M  (INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_V << INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_EFUSE_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_EFUSE_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_SW_INTR_MAP_REG register
 *  LP_SW_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_SW_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x264)
/** INTERRUPT_CORE1_LP_SW_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_SW_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_SW_INTR_MAP_M  (INTERRUPT_CORE1_LP_SW_INTR_MAP_V << INTERRUPT_CORE1_LP_SW_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_SW_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_SW_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_SW_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_TRNG_INTR_MAP_REG register
 *  LP_TRNG_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_TRNG_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x268)
/** INTERRUPT_CORE1_LP_TRNG_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_TRNG_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_TRNG_INTR_MAP_M  (INTERRUPT_CORE1_LP_TRNG_INTR_MAP_V << INTERRUPT_CORE1_LP_TRNG_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_TRNG_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_TRNG_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_TRNG_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_REG register
 *  LP_SYSREG_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x26c)
/** INTERRUPT_CORE1_LP_SYSREG_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_SYSREG_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_M  (INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_V << INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_SYSREG_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_SYSREG_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_REG register
 *  LP_APM_M0_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x270)
/** INTERRUPT_CORE1_LP_APM_M0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_APM_M0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_M  (INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_V << INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M0_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_APM_M0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_REG register
 *  LP_APM_M1_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x274)
/** INTERRUPT_CORE1_LP_APM_M1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_APM_M1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_M  (INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_V << INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M1_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_APM_M1_INTR_PASS_LEVEL_S  8

