espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_REG register
 *  LP_APM_M2_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x278)
/** INTERRUPT_CORE1_LP_APM_M2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_APM_M2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_M  (INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_V << INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M2_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_APM_M2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_REG register
 *  LP_APM_M3_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x27c)
/** INTERRUPT_CORE1_LP_APM_M3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_APM_M3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_M  (INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_V << INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_APM_M3_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_APM_M3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_REG register
 *  LP_PERI0_PMS_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x280)
/** INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_M  (INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_V << INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_PERI0_PMS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_REG register
 *  LP_PERI1_PMS_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x284)
/** INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_M  (INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_V << INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_PERI1_PMS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_HUK_INTR_MAP_REG register
 *  LP_HUK_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_HUK_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x288)
/** INTERRUPT_CORE1_LP_HUK_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_HUK_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_HUK_INTR_MAP_M  (INTERRUPT_CORE1_LP_HUK_INTR_MAP_V << INTERRUPT_CORE1_LP_HUK_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_HUK_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_HUK_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_HUK_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_REG register
 *  LP_PERI_TIMEOUT_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x28c)
/** INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_M  (INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_V << INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_PERI_TIMEOUT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_REG register
 *  LP_AHB_PDMA_IN_CH0_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x290)
/** INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_M  (INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_V << INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_REG register
 *  LP_AHB_PDMA_IN_CH1_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x294)
/** INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_M  (INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_V << INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_REG register
 *  LP_AHB_PDMA_OUT_CH0_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x298)
/** INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_M  (INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_V << INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default:
 *  0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_REG register
 *  LP_AHB_PDMA_OUT_CH1_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x29c)
/** INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_M  (INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_V << INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default:
 *  0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_AHB_PDMA_OUT_CH1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_REG register
 *  LP_SW_INVALID_SLEEP_INTR mapping register
 */
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2a0)
/** INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_M  (INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_V << INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_S)
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_MAP_S  0
/** INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default:
 *  0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_M  (INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_V << INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE1_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE1_SIG_IDX_ASSERT_IN_SEC_REG register
 *  reserved
 */
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_IN_SEC_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2a4)
/** INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S : R/W; bitpos: [5:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S    0x0000003FU
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S_M  (INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S_V << INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S_S)
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S_V  0x0000003FU
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_S_S  0
/** INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M : R/W; bitpos: [11:6]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M    0x0000003FU
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M_M  (INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M_V << INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M_S)
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M_V  0x0000003FU
#define INTERRUPT_CORE1_INT_SIG_IDX_ASSERT_IN_M_S  6

/** INTERRUPT_CORE1_INT_STATUS_REG_0_REG register
 *  Status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE1_INT_STATUS_REG_0_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2a8)
/** INTERRUPT_CORE1_INT_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31.
 *  Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE1_INT_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_STATUS_0_M  (INTERRUPT_CORE1_INT_STATUS_0_V << INTERRUPT_CORE1_INT_STATUS_0_S)
#define INTERRUPT_CORE1_INT_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_STATUS_0_S  0

/** INTERRUPT_CORE1_INT_STATUS_REG_1_REG register
 *  Status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE1_INT_STATUS_REG_1_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2ac)
/** INTERRUPT_CORE1_INT_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 32 ~
 *  63. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE1_INT_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_STATUS_1_M  (INTERRUPT_CORE1_INT_STATUS_1_V << INTERRUPT_CORE1_INT_STATUS_1_S)
#define INTERRUPT_CORE1_INT_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_STATUS_1_S  0

