espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_0_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_0_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2d8)
/** INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0_M  (INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0_V << INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0_S)
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_0_S  0

/** INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_1_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_1_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2dc)
/** INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1_M  (INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1_V << INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1_S)
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_1_S  0

/** INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_2_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 64 ~ 95
 */
#define INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_2_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2e0)
/** INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2_M  (INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2_V << INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2_S)
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_2_S  0

/** INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_3_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 96 ~ 127
 */
#define INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_3_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2e4)
/** INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 96 ~ 127. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3_M  (INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3_V << INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3_S)
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_3_S  0

/** INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_4_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 128 ~ 159
 */
#define INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_4_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2e8)
/** INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 128 ~ 159. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4_M  (INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4_V << INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4_S)
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_4_S  0

/** INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_5_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 160 ~ 168
 */
#define INTERRUPT_CORE1_SRC_PASS_IN_M_STATUS_5_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2ec)
/** INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5 : RO; bitpos: [8:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources with
 *  interrupt-index-range 160 ~ 168. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5    0x000001FFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5_M  (INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5_V << INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5_S)
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5_V  0x000001FFU
#define INTERRUPT_CORE1_INT_SRC_PASS_IN_M_STATUS_5_S  0

/** INTERRUPT_CORE1_CONFIG_STATE_REG register
 *  reserved
 */
#define INTERRUPT_CORE1_CONFIG_STATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2f0)
/** INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR : RO; bitpos: [0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR    (BIT(0))
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR_M  (INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR_V << INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR_S)
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR_V  0x00000001U
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_S_ERR_S  0
/** INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR : RO; bitpos: [1]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR    (BIT(1))
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR_M  (INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR_V << INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR_S)
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR_V  0x00000001U
#define INTERRUPT_CORE1_SIG_IDX_ASSERT_M_ERR_S  1

