espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core1_reg.h
/** INTERRUPT_CORE1_S_STATUS_REG register
 *  reserved
 */
#define INTERRUPT_CORE1_S_STATUS_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2f4)
/** INTERRUPT_CORE1_INT_S_STATUS : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE1_INT_S_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_S_STATUS_M  (INTERRUPT_CORE1_INT_S_STATUS_V << INTERRUPT_CORE1_INT_S_STATUS_S)
#define INTERRUPT_CORE1_INT_S_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_S_STATUS_S  0

/** INTERRUPT_CORE1_M_STATUS_REG register
 *  reserved
 */
#define INTERRUPT_CORE1_M_STATUS_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2f8)
/** INTERRUPT_CORE1_INT_M_STATUS : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE1_INT_M_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_M_STATUS_M  (INTERRUPT_CORE1_INT_M_STATUS_V << INTERRUPT_CORE1_INT_M_STATUS_S)
#define INTERRUPT_CORE1_INT_M_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE1_INT_M_STATUS_S  0

/** INTERRUPT_CORE1_CLOCK_GATE_REG register
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE1_CLOCK_GATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x2fc)
/** INTERRUPT_CORE1_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE1_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE1_REG_CLK_EN_M  (INTERRUPT_CORE1_REG_CLK_EN_V << INTERRUPT_CORE1_REG_CLK_EN_S)
#define INTERRUPT_CORE1_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE1_REG_CLK_EN_S  0

/** INTERRUPT_CORE1_INTERRUPT_DATE_REG register
 *  Version control register
 */
#define INTERRUPT_CORE1_INTERRUPT_DATE_REG (DR_REG_INTERRUPT_CORE1_BASE + 0x7fc)
/** INTERRUPT_CORE1_INTERRUPT_DATE : R/W; bitpos: [27:0]; default: 38834448;
 *  Version control register
 */
#define INTERRUPT_CORE1_INTERRUPT_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE1_INTERRUPT_DATE_M  (INTERRUPT_CORE1_INTERRUPT_DATE_V << INTERRUPT_CORE1_INTERRUPT_DATE_S)
#define INTERRUPT_CORE1_INTERRUPT_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE1_INTERRUPT_DATE_S  0

#ifdef __cplusplus
}
#endif
